{"CaseId": "case-389745848093-muen-2025-847bba583901836b", "DisplayId": "123456789012345", "Body": "Hi Joe,\n\nThank you for contacting AWS Premium Support. My name is Ben and I will be assisting with your inquiry today.\n\nI understand you are experiencing throttling issue with bedrock:Converse API and would like to know why.\n\nQuotas on this API is model specific, for example, if you're looking for the quotas for Claude 3.5 Sonnet, then this is the description you need to look for in Service Quotas Console:\n\n\tOn-demand InvokeModel requests per minute for Anthropic Claude 3.5 Sonnet\n\n\tNote: InvokeModel and Converse API uses the same quotas\n\nSeeing as you are an internal customer, all non-production AWS internal customers will have a default service quota limit equivalent to 2% of published limits. See below wiki if you would qualify for a limit increase:\n\n\thttps://amazon.com/bin/view/AmazonBedrock/Limit_Increase_all/internal_customer\n\nFurthermore, just to let you know, that AWS premium support is not staffed to work on support cases for AWS employees (anyone who works under AWS CEO). As you would be taking bandwidth from our customers.\n\nYou can refer to below for the same:\n\n\thttps://amazon.com/bin/view/AWS_Customer_Service/Concierge/Internal_Accounts/Processing_Internal_Requests\n\nCan you please make sure to reach out internally to Bedrock team or any other internal channels, like ML TFC if you require help\n\nWe also have number of slack channels for that matter like, for example: #bedrock-interest\n\nI hope you find the above information helpful. Please feel free to reach out to us if you have any further questions.\n\nWe value your feedback. Please share your experience by rating this and other correspondences in the AWS Support Center. You can rate a correspondence by selecting the stars in the top right corner of the correspondence.\n\nBest regards,\nBen H.\nAmazon Web Services", "SubmittedBy": "Amazon Web Services", "TimeCreated": "2025-02-18T01:42:54.573Z", "AttachmentSet": null, "AccountAlias": "chojoe+dev"}
{"CaseId": "case-389745848093-muen-2025-847bba583901836b", "DisplayId": "543210123456789", "Body": "Hello, when calling Bedrock, using the converse API, I often get the following message \n\n\"Too many requests, please wait before trying again.\"\n\nHow do I increase this limit?  I looked at the quotas section, and didn't see anything relevant.\n\nThank you.\n\nRegion: us-east-1\nAWS Region: us-east-1", "SubmittedBy": "Admin-OneClick/chojoe-Isengard (Role) <chojoe+dev@amazon.com>", "TimeCreated": "2025-02-17T22:35:43.286Z", "AttachmentSet": null, "AccountAlias": "chojoe+dev"}
