{"CaseId": "case-456789012345-muen-2025-mno345pqr678stu9", "DisplayId": "945612347885012", "Body": "Hello AWS Support,\n\nWe're experiencing a strange issue with the AWS EC2 DescribeInstances API. We're trying to list all our EC2 instances across multiple regions, but the results we're getting are inconsistent and confusing.\n\nSpecifically:\n1. Sometimes the API returns instances that we're sure we've terminated.\n2. In other cases, it's not returning instances that we can see running in the console.\n3. Occasionally, we get a successful response, but the 'Reservations' list is empty, even though we have active instances.\n\nWe're using the AWS SDK for Python (Boto3) version 1.26.90, and our code looks something like this:\n\nimport boto3\n\ndef get_all_instances():\n    instances = []\n    for region in boto3.session.Session().get_available_regions('ec2'):\n        ec2 = boto3.client('ec2', region_name=region)\n        response = ec2.describe_instances()\n        for reservation in response['Reservations']:\n            instances.extend(reservation['Instances'])\n    return instances\n\nWe've tried increasing the MaxResults parameter and using pagination, but the issues persist. We've also verified that our IAM permissions are correct.\n\nCan you help us understand what might be causing these inconsistencies and how we can get accurate results?\n\nThank you,\nMichael\n\nRegion: us-west-2\nAWS Region: us-west-2", "SubmittedBy": "Admin-OneClick/michaellee-Isengard (Role) michaellee+dev@cloudops.com ", "TimeCreated": "2025-07-10T09:15:43.210Z", "AttachmentSet": null, "AccountAlias": "cloudops-dev"}
{"CaseId": "case-456789012345-muen-2025-mno345pqr678stu9", "DisplayId": "123456789054321", "Body": "Hello Michael,\n\nThank you for contacting AWS Premium Support. My name is Emma, and I'm here to help you with the issues you're experiencing with the EC2 DescribeInstances API.\n\nI understand you're encountering inconsistent results when trying to list EC2 instances across multiple regions. Let's address each of the issues you've mentioned:\n\n1. Terminated instances appearing in results:\n   - The DescribeInstances API can return information about terminated instances for a short period after termination (usually up to about an hour). This is by design to allow for consistent API behavior during instance state transitions.\n   - To filter these out, you can check the 'State' field of each instance and only process those with a state of 'running'.\n\n2. Running instances not appearing in results:\n   - This could be due to eventual consistency in the AWS APIs. Changes may take some time to propagate across all systems.\n   - Ensure you're not using any filters in your DescribeInstances call that might inadvertently exclude these instances.\n\n3. Empty 'Reservations' list:\n   - This could happen if there are truly no instances in the region, or if there's an issue with permissions.\n   - Double-check your IAM permissions to ensure they allow DescribeInstances in all regions.\n\nHere are some suggestions to improve your code and troubleshoot the issues:\n\n1. Use pagination explicitly:\n   python\n   def get_all_instances():\n       instances = []\n       for region in boto3.session.Session().get_available_regions('ec2'):\n           ec2 = boto3.client('ec2', region_name=region)\n           paginator = ec2.get_paginator('describe_instances')\n           for page in paginator.paginate():\n               for reservation in page['Reservations']:\n                   instances.extend(reservation['Instances'])\n       return instances\n   \n\n2. Add error handling and logging.\n3. Filter for running instances only.\n4. Implement retries with exponential backoff for API calls.\n5. Consider using the AWS Config service to maintain an inventory of your EC2 instances across regions.\n\nPlease try implementing these changes and let me know if you still encounter issues. If problems persist, it would be helpful if you could provide:\n\n1. A specific example of an instance that's running but not appearing in results.\n2. The exact API response you're getting when the 'Reservations' list is empty.\n3. Your IAM policy JSON for the role or user making these API calls.\n\nWe value your feedback. Please share your experience by rating this and other correspondences in the AWS Support Center. You can rate a correspondence by selecting the stars in the top right corner of the correspondence.\n\nBest regards,\nEmma R.\nAmazon Web Services", "SubmittedBy": "Amazon Web Services", "TimeCreated": "2025-07-10T10:30:27.543Z", "AttachmentSet": null, "AccountAlias": "cloudops-dev"}
